import folium
from matplotlib.pyplot import subplots_adjust
#버스 정류장 위치 데이터 셋 생성
from pandas import DataFrame

# 춘천시 팔호 광장 버스 정류장 30개 
bus_stop = {'위도' : [37.8756, 37.87523, 37.87632, 37.87659, 37.87335, 37.87831, 37.87853, 37.87777, 37.87743, 37.85244,
                                37.94118, 37.94082, 37.87925, 37.87955, 37.87827, 37.77613, 37.77611, 37.77155, 37.77151, 37.78722,
                                37.78717, 37.78957, 37.77609, 37.89845, 37.89847, 37.88567, 37.85834, 37.85767, 37.88105],
                    
                    
                    '경도' : [127.73532, 127.73503, 127.73345, 127.73428, 127.7341, 127.72502, 127.72545, 127.73813, 127.73763, 127.71515,
                            127.71214, 127.71244, 127.7504, 127.75003, 127.73953, 127.63149, 127.6314, 127.64098, 127.64082, 127.64816, 
                            127.64817,127.64698, 127.63417, 127.76812, 127.76801, 127.71602, 127.70757, 127.70756, 127.72657],
                            
                            
                    '구분' : ['팔호광장(EMI학원)', '팔호광장(순복음교회)', '동부시장(1)', '동부시장(2)', '미려골', '중앙시장(1)/중앙초교', '중앙시장(2)', '교동초교입구(1)', '교동초교입구(2)',
                            '_88공원', '_102보충대(1)', '_102보충대(2)', '신한은행후평동지점', '충인교회','(구)보훈청', '창촌3리약수터(1)', '창촌3리약수터(2)', '창촌3리(1)', '창촌3리(2)', 
                            '창촌3거리(1)','창촌3거리(2)', '창촌1리', '재직골', '장학1리(1)', '장학1리(2)', '춘천역육교앞', '호반요양병원(1)', '호반요양병원(2)','인성병원']}

bus_stop = DataFrame(bus_stop)
bus_stop

#지도의 중심 지정
#folium.Map([위도, 경도], zoom_start = num)
map = folium.Map([37.87523, 127.73503], zoom_start = 13)
map

for i in bus_stop.index:
    sub_lat = bus_stop.loc[i, '위도']
    sub_long = bus_stop.loc[i, '경도']

    name = bus_stop.loc[i, '구분']

    color = 'green'
    folium.CircleMarker([sub_lat, sub_long], color = color, radius = 5, tooltip = name).add_to(map)

map.save('example.html')
map





