import folium
from matplotlib.pyplot import subplots_adjust
#버스 정류장 위치 데이터 셋 생성
from pandas import DataFrame

# 춘천시 팔호 광장 버스 정류장 30개 
bus_stop = {'위도' : [37.8756, 37.87523, 37.87632, 37.87659, 37.87335, 37.87831, 37.87853, 37.87777, 37.87743, 37.85244,
                                37.94118, 37.94082, 37.87925, 37.87955, 37.87827, 37.77613, 37.77611, 37.77155, 37.77151, 37.78722,
                                37.78717, 37.78957, 37.77609, 37.89845, 37.89847, 37.88567, 37.85834, 37.85767, 37.88105],
                    
                    
            '경도' : [127.73532, 127.73503, 127.73345, 127.73428, 127.7341, 127.72502, 127.72545, 127.73813, 127.73763, 127.71515,
                                127.71214, 127.71244, 127.7504, 127.75003, 127.73953, 127.63149, 127.6314, 127.64098, 127.64082, 127.64816, 
                                127.64817,127.64698, 127.63417, 127.76812, 127.76801, 127.71602, 127.70757, 127.70756, 127.72657],
                            
                            
            '구분' : ['팔호광장(EMI학원)', '팔호광장(순복음교회)', '동부시장(1)', '동부시장(2)', '미려골', '중앙시장(1)/중앙초교', '중앙시장(2)', '교동초교입구(1)', '교동초교입구(2)',
                                '_88공원', '_102보충대(1)', '_102보충대(2)', '신한은행후평동지점', '충인교회','(구)보훈청', '창촌3리약수터(1)', '창촌3리약수터(2)', '창촌3리(1)', '창촌3리(2)', 
                                '창촌3거리(1)','창촌3거리(2)', '창촌1리', '재직골', '장학1리(1)', '장학1리(2)', '춘천역육교앞', '호반요양병원(1)', '호반요양병원(2)','인성병원']}

bus_stop = DataFrame(bus_stop)
bus_stop

#춘천시 건물 30개 
building = {'위도' : [37.877373, 37.87763, 37.875189, 37.8745116, 37.8828674, 37.8818835, 37.8830512, 37.8753165, 37.8698388, 37.8776958,
                                37.874924, 37.877031, 37.8762881, 37.874979, 37.8760356, 37.874803, 37.8767051, 37.8761936, 37.8787063, 37.8792003,
                                37.874979, 37.874979, 37.8796889, 37.874979, 37.877033, 37.8837907, 37.874979, 37.8781044, 37.874979],
                    

            '경도' : [127.7349277,127.7350245,127.7345445,127.7350403,127.7329356,127.7349127,127.7281361,127.7214754,127.7314084,127.7386619,
                                127.7163663,127.73588,127.7359534,127.726012,127.7352019,127.7449876,127.7348312,127.7340836,127.7288788,127.716356,
                                127.716356,127.7163561,127.716356,127.7287761,127.735622,127.7272566,127.716356,127.716356,127.716356],


            '구분' : ['음식점', '음식점', '음식점', '음식점', '음식점', '음식점', '음식점', '음식점', '음식점', '음식점',
                                '카페', '카페', '카페', '카페', '병원', '병원', '병원', '병원', '병원', '병원', '병원',
                                 '병원', '병원', '병원', '취미공간', '식료품점', '식료품점', '식료품점', '식료품점']}

building = DataFrame(building)
building

#지도의 중심 지정
#folium.Map([위도, 경도], zoom_start = num)
map = folium.Map([37.87523, 127.73503], zoom_start = 13)
map

#버스정류장 위치 마커 표시
for i in bus_stop.index:
    sub_lat = bus_stop.loc[i, '위도']
    sub_long = bus_stop.loc[i, '경도']

    name = bus_stop.loc[i, '구분']

    folium.Marker([sub_lat, sub_long], tooltip = name).add_to(map)

map.save('example.html')
map

#건물 위치 마커 표시
for j in building.index:
    sub_lat = building.loc[j, '위도']
    sub_long = building.loc[j, '경도']

    name = building.loc[j, '구분']

    color = 'blue'
    if building.loc[j, '구분'] == '음식점' :
        color = 'red'

    if building.loc[j,'구분'] == '카페' : 
        color = 'orange'

    if building.loc[j, '구분'] == '병원' :
        color = 'green'

    if building.loc[j, '구분'] == '식료품점' :
        color = 'black'
    
    folium.CircleMarker([sub_lat,sub_long],color = color,radius = 5, tooltip = name).add_to(map)
   
map.save('example.html')
map





